In [1]:
import pandas as pd
pd.__version__

'1.0.3'

In [2]:
series = pd.Series(['a','b','c'])
series

0    a
1    b
2    c
dtype: object

In [3]:
series[2]

'c'

In [4]:
series = pd.Series(['a','b','c'], index = [3,2,3])
series

3    a
2    b
3    c
dtype: object

In [5]:
series.index

Int64Index([3, 2, 3], dtype='int64')

In [6]:
series[3]

3    a
3    c
dtype: object

In [7]:
import pandas as pd

df = pd.read_excel('data/환율-20180914.xls', index_col='통화명')
df.head()

                 매매기준율  현찰 - 사실 때  현찰 - 파실 때  송금 - 보내실 때  송금 - 받으실 때  미화환산율
통화명
미국 USD         1122.50    1142.14    1102.86     1133.50     1111.50  1.000
유럽연합 EUR       1304.23    1330.18    1278.28     1317.27     1291.19  1.162
일본 JPY (100엔)  1007.22    1024.84     989.60     1017.09      997.35  0.897
중국 CNY          163.96     172.15     155.77      165.59      162.33  0.146
홍콩 HKD          143.02     145.83     140.21      144.45      141.59  0.127

In [9]:
df1 = pd.DataFrame([
    [100, 230, 90],
    [140, 150, 40],
    [110, 100, 50]
])
df1

     0    1   2
0  100  230  90
1  140  150  40
2  110  100  50

In [11]:
df1[1]

0    230
1    150
2    100
Name: 1, dtype: int64

In [12]:
df1.loc[1]

0    140
1    150
2     40
Name: 1, dtype: int64

In [15]:
df1[3] = [200, 210, 220]
df1

     0    1   2    3
0  100  230  90  200
1  140  150  40  210
2  110  100  50  220

In [17]:
print(df1.shape)
df1.head()

(3, 4)

     0    1   2    3
0  100  230  90  200
1  140  150  40  210
2  110  100  50  220

In [20]:
df1 = df1.set_index('이름')
df1

TypeError: 'method' object is not subscriptable